[
  {
    "path": "posts/2021-02-09-my-second-post/",
    "title": "DataViz Makeover 02",
    "description": "This blog is creating a data visualization of public willingness for Covid-19 vaccination. There are two main charts, which I use: Diverging Stacked Bar Charts and Bar Charts with Uncertainty",
    "author": [
      {
        "name": "Dan Hai",
        "url": "http://linkedin.com/in/dan-hai-1283091b4"
      }
    ],
    "date": "2021-02-09",
    "categories": [],
    "contents": "\n1. Critique of Data Visualization\n\n\n\n1.1 Clarity\nApart from Strongly Agree and Strongly Disagree, the other three categories are not expressed the meaning, so accurate information from the legend cannot be obtained.\nAs 100% stacked bar chart, it is not clear how much support each country has for vaccines, comparing the middle three categories among those countries are difficult.\nReading the percentage value of strongly disagree is difficult. Also reading the percentage value of the sum of strongly disagree and category 4 is difficult\nThe bar chart on the right is clear and easy to understand, also it is sorted for the audience to read. However, it could be improve by using uncertainty\n1.2 Aesthetic\nThe distribution of the colors is not consistent enough. Strongly Agree/Strongly Agree should be used more brighten color.\nLegend on the right top corner is vague.\nIt is not a excellent data visualization since I want to compare different country’s opinion on pro-vaccine. So I believe it is better to change to diverging stacked bar chart in the view of comparison.\nThe initial letter of country name is in lower case in both chart, which is not professional.\nColor scale can be better chosen to reflect ordinal data type, which color scale can be more efficiently used.\nThere is a typo in Chart 1 title, as vaccine is mis-spelling as “vacinne”\nWay to Improve Current Design\n1.3 Improve from Clarity\nAdd “2”, “3”, and “4” can be modified to “2 – Agree”, “3 – Neutral”, and “4 – Disagree” at the right legend to convenient the audience to understand\nDiverging stacked bar chart is more suitable with the comparison by showing the negative percentge reperesent the strongly disagree and disagree.\nWhen drawing many samples from a population, it is possible to obtain a few with means that greatly differ from the population. So we can use uncertainy by adding standard error for the bar chart in the right side.\nFor greater clarity, the exact survey question will be stated in the visualization so that the user is able to know exactly what is the question of vac_1.\n1.4 Improve from Aesthetics\nInstead of using 5 separate colors, we can use a more distinct color such as gradient from red to dark blue.\nIt is recommended to use diverging stacked bar chart and create Gantt Percent, which can represent the each category with better data visualization.\nChange the initial letter of country name in upper case.\nChange the typo by its correct form “vaccine”\n2 Sketch of Proposed Design\n2.1 Sketch\n\n\n\n2.2 Advantages of Propose Design\nPlease view the visualization on Tableau Public \nWe can clearly see from the figure that United Kingdom is on the far right, indicating strong opposition to vaccines. This is the advantage of Diverging Stack Bar Chart to view each segment of opinion with Likert Scale data. Also, I added a clear legend to make the audience easy to visualize the chart. The progression of colors also has a visual effect, such as strong agree is red and agree is pink.\nThe standard deviation is a property of the population. It tells us how much spread there is among individual observations we could make.So when we applied the uncertainty to the bar chart with the population data. It is a more appropriate and precise way to present the data visualization. And we can clear see the range from confidence interval within 95%.\n3 Step -by-step Description on Data Visualization Design Process\n3.1.1 Data Preparetion for Diverging Stacked Bar Chart\nImport Data into Tableau and union all the data\n\n\n\nView the column and hide redundant column\n\n\n\nSplit [Table Name] and render the column name as [country]\n\n\n\nTableau can help us break up the whole column with ’ . ’\n\n\n\nNow we get the clean country column.\nUse Create Calculated Field to redefine [vac_1]\nWhen creating score column, I changed Strongly Agree to the lowest value, 1, and then increased it to the highest value, 5. The purpose is to present strongly disagree and disagree in the negative region\n\n\n\nFormula is 6-int(left([vac_1],1)). The reason for using this formula is that I want strong disagreement and agreement to be shown as negative axis in the diverging stacked bar\nCreate Number of record, Total count and Percentage column\n\n\n\nCreate Total count negative, Total count and Gantt Start column\n\n\n\n\n\n\nCreate Gantt Percentage\n\n\n\nExplanation :ZN(expression) returns the expression if it is not null, otherwise returns zero. Use this function to use zero values instead of null values.\n3.1.2 Data Visualization for Diverging Stacked Bar Chart\nChange score into dimension\n\n\n\nAliases Score and Country Column\n\n\n\n\n\n\nNow we can see that in this score column 1 stands for Strongly Disagree and 2 stands for Agree. At the same time, we revised the first capital letter of each country, which make it looks more formal.\n3.Drag score to Fliters, Grand Percentage to Column and country to Row\n\n\n\n\n\n\nAt the same time of this step, we set Chart as Gantt Bar.\n4.Drag Percentage to Size and Country to Detail\n\n\n\n\n\n\nWhile we are doing this, we set up the colors and choose an appropriate theme for color.\nAdd household size, gender and employment status to dig insight information\n\n\n\nFinally, it was found that household size had an obvious impact on attitudes towards vaccines，so we retained this Filters.\n3.2.1 Data Preparation for Uncertainty Bar Chart\nCreating Calculated Fields and Parameters\nCreate a new worksheet and rename it as ‘Uncertainty Chart’. The first step would be to create the necessary calculated fields and parameters. And I create a new score proportion to use to count the number of strongly disagree\n\n\n\nCreating a calculated field for Prop: proportion is generate by using the sum number of strongly agree divide by the sum number of total\n\n\n\nCreating a calculated field for Prop_SE: standard error is calculate by proportion multiplied by (1 - proportion). Then this number divided by the sum of the number of records. In the end, using square root for the calculated number.\n\n\n\nCreating a calculated field for Z_95%: Z = 1.959964\n\n\n\nCreating a calculated field for Prop_Margin of Error: Formula for margin of error is the Z_95% multiplied by the standard error.\n\n\n\nCreating a calculated field for Prop_Upper Limit 95% and Prop_lower Limit 95%\n\n\n\n3.2.2 Data Visualization for Uncertainty Bar Chart\n1.Add score to filter to exclude NULL variable\n2.Prop is added to Columns and Country is added to Rows\n\n\n\nAdd measure value to the black above country.Then Measure Values is added to columns. The next step is , remove all items except for AGG(Prop_Lower Limit 95%) and AGG(Prop_Upper Limit 95%) under the Measure Values pane.\n\n\n\n\n\n\nMove the Measure Value in front of Prop. Then click on the down arrow on Measure Values and select dual axis.\n\n\n\n\n\n\nChange the Measure Values in the mark section into chart, and drag Measure Name in the the icon path\n\n\n\nDashboard\n1.Add title:\nFirst graph add title : “Willingness of the public on Covid-19 vaccination from different countries and household size” with green background\nSecond graph add title : “Percentage of Strongly Agree with 95% CI” with green background\n2.Add commentary:\nOn the top and add text: “If you want to compare the influence of household on the attitude towards vaccines, you can use filter function. We observed that in France, the smaller the household, the more negative the attitude towards vaccines”\n3.Add source:\nUsing Objects > Text > drag to bottom left and add : ““Source: Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub (https://github.com/YouGov-Data/covid-19-tracker)”\n4.Add author:\nAdd text to bottom right corner and add text : “Author: Dan Hai”.\n4. Final Visualization\n4.1 Snapshot of Dashboard\n\n\n\n4.2 Main observations\nAs can be seen from diverging stacked bar chart, compared with other countries, the percentage of French people who strongly agree is the highest.\nAlso in the stacked bar chart, it can be seen that the United Kingdom has the highest degree of acceptance of vaccines, because the bar chart is on the far right, and the proportion of strongly agree is also the highest, followed by Denmark\nAs can be seen from the second Proportion chart, the United Kingdom has the highest degree of Strongly Agree, Japan has the lowest degree of Strongly Agree. And South Korea and Netherlands have the widest confidence interval, which are range from 24% to 27% and range from 39% to 44%.\n\n\n\n",
    "preview": "posts/2021-02-09-my-second-post/Picture/example.png",
    "last_modified": "2021-02-28T23:24:28+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-26-my-first-post/",
    "title": "DataViz Makeover 01",
    "description": "Below is my first DataViz Makeovers assignment. First bar chart is my main chart. Besides, Pyramid and Line chart are for detailed comparison.",
    "author": [
      {
        "name": "Dan Hai",
        "url": "https://www.singstat.gov.sg/"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\na. Critique of Data Visualization\nClarity\nThe purpose of this chart is to compare the change of the percentage of Labour in 2009 with that in 2019. However, the title is misleading or incomplete. The title only mentions the age but does not mention the year.\nThe lack of Y-axis as a reference for data makes it impossible for us to observe specific differences. There is also lack of the tick mark, which tells us the value of each point so that we can make comparisons. The only thing we can tell from the chart is that the age group of the workforce in 2009 was younger than 55 than in 2019, but by how much?\nIt is not accurate enough. If the title indicates that the whole calculation process is a percentage, then the table at the bottom should also indicate that it is a percentage. However, the figure only shows the data and does not explain the number format\nIt is a mistake to use the chart. According to the above meaning and the meaning expressed in the picture, we want to compare the differences of each age group between 2009 and 2019. However, the problem is that line chart and line chart are suitable for comparing trends, such as the rise and fall of stocks. I believe that line chart is not the most suitable chart in this visual analysis.\nAesthetic\nThe combination of colours is not eye-catching\nLegend is missing. Normally, which year represents what colour should be displayed in the upper right corner to help readers distinguish more easily\nThe table at the bottom affects aesthetics. Readers need to spend more time extracting the data of each age group. At the same time, there are too many words in the icon, which makes it very cumbersome\nWhile the text is too cumbersome, the two lines are too simple. The details of the lines should be changed\nb. Way to Improve Current Design\nCritique from Clarity\nTitle needs to be precise. It can be changed as “Resident labor force change between Year 2009 and Year 2019 by age”\nAdd Y-axis as a reference on the chart and the calculation format should be percentage\nAdd value label on each point to clearly show the different between Year 2009 and Year 2019\nAfter careful consideration and attempt, I suggest using bar chart to compare the differences between each age group in 2009 and 2019. The advantage of bar chart is that it can effectively display the differences and values\nCritique from Aesthetic\nUsing color such as blues and oranges can add simplicity and aesthetics to a chart\nAdd legend on the right top corner to identify the color and category\nCreate a new dashboard, which first summarizes the differences between 2009 and 2019, at the same time, create the labor differences between men and women, and then refine the data to a single age period such as age 15-19 from 2009 to 2019 based on data.\nAvoid adding too much text to simplify the graph. Mention the main point is good enough.\nSketch of Proposed Design\n\nFirst bar chart is my main chart. Besides, Pyramid and Line chart are for detail comparison.The first chart is a bar chart. Before that, my research direction is to enable the audience to see the comparison of the change of labor in each age group between 2009 and 2019. I want to compare the proportion of labor in 2009 and 2019 through the height of the bar chart. Y-axis is percentage and X-axis is age. Compared with the previous graph, the bar chart can more accurately reflect the change of each age level between 2009 and 2019, and the visual effect is more intuitive.\nThe second chart is Pyramid chart. I plan to integrate the data of male and female together and make a comparison by integrating the data, and the year is used as a filter, so that we can browse the labor ratio of male and female in different age groups in different year.\nThe third graph is a simple line graph, but I mainly want to observe the trend change of a specific age group from 2009 to 2019, so I think the graph is the best way to reflect the trend change. By setting the age group as FILTER, we can observe the trend change of each age group from 2009 to 2019.\nc. Step -by-step Description on Data Visualization Design Process(c& d combine into one)\nAction\nInspecting the raw excel data file\nWe see that there are three sheets in the data set, which are the changes of total labor force, male labor force and female labor force from 2009 to 2019.\nBased on the data, we can make a graph of the change for each age group in 2009 and 2019. The best graph to show the change is the bar chart. Then we can make a pyramid chart to show the change for men and women\n\nExtra Data Clean Process - When we import Data and find that every column and row have NULL values, we can use function-Use Data Interpreter, and Data Interpreter will help us automatically exclude NULL values and organize the Data\nBar Chart\n\n\nFirst of all, the big difference between the graph and my Scratch design is that the Y axis is changed into age, while the X axis is changed into percentage. In this way, the changes of different age groups in 2009 and 2019 can be better displayed\nI put the measure name in the filter to screen out the two years of 2009 and 2019 for comparison. The advantage of this is that I can change the target of comparison at any time. I also put variable age in the filter to get rid of total and null, because they are not important in the picture\nAnd I change the format of the X-axis into percentage, to give the audience an intuitive experience\nLine Chart\n\n\nFirstly, the X-axis is year, and the last axis is percentage. This graph is actually an auxiliary graph of the bar chart above. Bar chart has the effect of overview, and the graph directly tells the audience what the change trend of ten years in a certain age group\nAt the same time, I changed the format of Y axis into percentage, and added the label of each point to make it clearly to observe\nPyramid Chart\nI use Pyramid chart to compare gender differences in labor, but since male and female are in two tables, I use Excel to put male and female in the same column, as shown in the figure below. \nThen import into Tableau and we use Pivot function to combine year into one column, then table show as below. \nAnd we use Analysis -> create calculation field to create Females and Males variable \n\nAt the same time, you also find that I change age into descending, and the label format of Y axis into percentage, all of which make the graph more intuitive.\nAlso, year, as a filter, can flexibly compare the gender ratio of labor force in any year\nd. Three Major Observations Revealed by the Data Visualization on Each Graph\nBar chart on total labor force difference between 2009 and 2019\n\nThe biggest difference was among those aged 65 to 69, with the labor force growing by nearly 16.3 percent in 2019\nOnly in the age group of 20 to 24 did the percentage of the labor force decrease\nThe percentage of the labor force as a whole is on the rise\nLine Chart on Labor Force Change from 2009 to 2019 between Age Group 15-19\n\nThe percentage of the labor force was the highest in 2015 and reached 15.8 percent\nThe percentage of the labor force fell sharply from 2010 to 2011\nThe percentage of the labor force rose sharply from 2014 to 2015\nPyramid Chart\n\nThe female workforce is substantially higher than the male workforce at ages above 65\nThe male labor force is highest in the 25-29 age group and reach 86 percent\nThe female labor force is highest in the 25-29 age group and reach 89 percent\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-17T23:02:48+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to my blog, Data Visualization. This blog is present analysis through Tableau and R studio. Hope you are enjoy it!",
    "author": [
      {
        "name": "Dan Hai",
        "url": "http://linkedin.com/in/dan-hai-1283091b4"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-09T10:04:15+08:00",
    "input_file": {}
  }
]
